# 파이썬 기초
# oop 연습문제

# 계좌 클래스 만들기
# attribute : 계좌 초기금액
# 생성자에서 초기금액은 0으로 성정
# 속성은 private로 설정
# method : 인출, 저축, 잔약 세가지. 각각 현재 금액 리턴
# 각 method는 private 으로 설정


# 학생 성적 관리 class 만들기
# attribute : 국어, 영어, 수학점수 및 학생 이름
# 생성자에서 각 속성을 객체 생성시 전달된 인자값으로 설정
# 각 속성은 private으로 설정
# method : 전체 과목 점수 평균, 전체 과목 총점 리턴
# 각 method 는 private 으로 설정


# 피자가게 관리 class
# attribute : 피자종류(리스트), 피자 가게 이름
# 생성자에서 각 속성을 객체 생성시 전달된 인자값으로 설정, 피자 종륲는 (슈퍼슈프림, '콤비네이션', '치즈')
# 각 속성은 private으로 설정
# method : 원하는 피자를 제공하는지 알려주는 기능. YES 또는 NO 리턴